Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: Optionally set a theme with :cpp:func:`lv_display_set_theme`.
it_it: Facoltativamente, si imposta un tema con :cpp:func:`lv_display_set_theme`.

source: Optionally use :cpp:func:`lv_barcode_set_encoding` to set :cpp:enumerator:`LV_BARCODE_ENCODING_CODE128_RAW`.
it_it: Facoltativamente, si usa :cpp:func:`lv_barcode_set_encoding` per impostare :cpp:enumerator:`LV_BARCODE_ENCODING_CODE128_RAW`.

source: Optionally you can also use :cpp:func:`lv_group_focus_next` or :cpp:func:`lv_group_focus_prev` or the ``TAB`` key on keyboard as usual.
it_it: Facoltativamente, è possibile utilizzare anche :cpp:func:`lv_group_focus_next` o :cpp:func:`lv_group_focus_prev` o il tasto ``TAB`` sulla tastiera, come di consueto.

source: Optionally, ``min_value`` and/or ``max_value`` can be set to limit the subject's value.
it_it: Facoltativamente, è possibile impostare ``min_value`` e/o ``max_value`` per limitare il valore del subject.

source: Optionally, you can also introduce a delay between the forward and backward directions using :cpp:expr:`lv_anim_set_reverse_delay(&anim_template, delay_in_ms)`
it_it: Facoltativamente, si può anche introdurre un ritardo tra la direzione avanti e quella indietro usando :cpp:expr:`lv_anim_set_reverse_delay(&anim_template, delay_in_ms)`

source: Optionally, you can use a command-line argument to cause the image contents to be compressed using RLE or LZ4 compression as well.
it_it: Facoltativamente, è possibile utilizzare un argomento da riga di comando per comprimere il contenuto dell'immagine utilizzando la compressione RLE o LZ4.

source: Options
it_it: Opzioni

source: Options like ``LV_OPA_TRANSP``, ``LV_OPA_10``, etc., can also be used.
it_it: È possibile utilizzare anche opzioni come ``LV_OPA_TRANSP``, ``LV_OPA_10``, ecc.

source: Or
it_it: Oppure

source: Or a custom component:
it_it: Oppure un componente "custom":

source: Or both of the above can be done at the same time: :cpp:expr:`lv_obj_set_style_transform_rotation(scale, LV_SCALE_LABEL_ROTATE_MATCH_TICKS + 200, LV_PART_INDICATOR)`.
it_it: Oppure è possibile eseguire entrambe le operazioni contemporaneamente: :cpp:expr:`lv_obj_set_style_transform_rotation(scale, LV_SCALE_LABEL_ROTATE_MATCH_TICKS + 200, LV_PART_INDICATOR)`.

source: Or download the FFmpeg library from `its official download page <https://www.ffmpeg.org/download.html>`__, then install it:
it_it: Oppure scaricare la libreria FFmpeg dalla `pagina di download ufficiale <https://www.ffmpeg.org/download.html>`__, quindi installarla:

source: Or to add styles:
it_it: Oppure per aggiungere stili:

source: Or to create non-``lv_obj_t`` children:
it_it: Oppure per creare elementi figlio non-``lv_obj_t``:

source: Or use the heading's text as the link's text:
it_it: Oppure usare il testo dell'intestazione come testo del link:

source: Or use the sleep time automatically calculated by LVGL:
it_it: Oppure utilizzare il tempo di sleep calcolato automaticamente da LVGL:

source: Or via styles:
it_it: Oppure tramite stili:

source: Or you can use ``static uint8_t buffer[LV_CANVAS_BUF_SIZE(width, height, bits_per_pixel, stride_in_bytes)]``.
it_it: Oppure si può usare ``static uint8_t buffer[LV_CANVAS_BUF_SIZE(width, height, bits_per_pixel, stride_in_bytes)]``.

source: Or:
it_it: Oppure:

source: Order of Creation
it_it: Ordine di Creazione

source: Orientation and size
it_it: Orientamento e Dimensioni

source: Originally developed by Silicon Graphics in 1992, OpenGL has become one of the most widely adopted graphics APIs across desktop, mobile, and embedded platforms.
it_it: Sviluppata originariamente da Silicon Graphics nel 1992, OpenGL è diventata una delle API grafiche più ampiamente adottate su piattaforme desktop, mobili ed embedded.

source: Orthographic and perspective projection modes
it_it: Modalità di proiezione ortografica e prospettica

source: Other Events
it_it: Altri Eventi

source: Other Features
it_it: Altre Funzionalità

source: Other Integrations
it_it: Altre integrazioni

source: Other Platforms and Tools
it_it: Altre Piattaforme e Tool

source: Other Products
it_it: Altri prodotti

source: Other Widgets can use the same *event callback*.
it_it: Altri Widget possono utilizzare la stessa *callback dell'evento*.

source: Other callbacks
it_it: Altre callback

source: Other conduct which could reasonably be considered inappropriate in
it_it: Altre condotte che potrebbero ragionevolmente essere considerate inappropriate in

source: Other displays are maintained in `esp-bsp repository <https://github.com/espressif/esp-bsp/tree/master/components/lcd>`__ and are uploaded to ESP Registry
it_it: Altri display sono mantenuti nel repository `esp-bsp repository <https://github.com/espressif/esp-bsp/tree/master/components/lcd>`__ e vengono caricati nell'ESP Registry

source: Other features
it_it: Altre funzionalità

source: Other keys will be passed to the focused widget as they are.
it_it: Gli altri tasti verranno passati al widget selezionato così come sono.

source: Other parameters use ``property-param`` notation.
it_it: Altri parametri utilizzano la notazione ``property-param``.

source: Other times it involves computing those colors before they are written (e.g. combining them with other colors when an object higher on the Z axis has partial opacity).
it_it: Altre volte comporta il calcolo di quei colori prima che vengano scritti (ad esempio, combinandoli con altri colori quando un oggetto più in alto sull'asse Z ha un'opacità parziale).

source: Others
it_it: Altri

source: Otherwise there is no case for setting it.
it_it: Altrimenti non è necessario impostarlo.

source: Otherwise, LVGL will allocate memory to store a copy of the name.
it_it: In caso contrario, LVGL allocherà memoria per memorizzare una copia del nome.

source: Otherwise, if the width or height are explicitly set (using e.g.\ :cpp:func:`lv_obj_set_width` or a layout), the lines wider than the Label's width can be manipulated according to several long mode policies.
it_it: In alternativa, se la larghezza o l'altezza vengono impostate esplicitamente (ad esempio, utilizzando :cpp:func:`lv_obj_set_width` o un layout), le righe più larghe della larghezza dell'etichetta possono essere manipolate in base a diverse policy di "modalità lunga".

source: Otherwise, the program may crash or behave abnormally.
it_it: In caso contrario, il programma potrebbe bloccarsi o comportarsi in modo anomalo.

source: Otherwise, there is no easy way of detecting that the underlying file has changed and LVGL will still draw the old image from cache.
it_it: Altrimenti, non esiste un modo semplice per rilevare che il file sottostante è cambiato e LVGL continuerà a estrarre la vecchia immagine dalla cache.

source: Otherwise, they are cleared.
it_it: In caso contrario, vengono cancellate.

source: Our Pledge
it_it: Il nostro Impegno

source: Our Responsibilities
it_it: Le nostre Responsabilità

source: Our Standards
it_it: I Nostri Standard

source: Outline
it_it: Outline [contorno]

source: Outline (a border with its own styles)
it_it: Contorno (un bordo con i propri stili)

source: Outline styles
it_it: Stili per i Contorni

source: Outlines
it_it: Contorni

source: Output API as JSON Data
it_it: API di Output come Dati JSON

source: Output Data
it_it: Dati di Output

source: Output Pane
it_it: Pannello "Output"

source: Overlays can be used to enable/disable features for specific boards or build targets.
it_it: Gli overlay possono essere utilizzati per abilitare/disabilitare funzionalità per schede specifiche o target di build.

source: Override default start point for series
it_it: Ignorare il punto di inizio di default per le serie

source: Overview
it_it: Panoramica

source: Overview of the build
it_it: Panoramica della build

source: PC Simulator
it_it: Simulatore per PC

source: PN refers to a recipe name in the context of a file used by the OpenEmbedded build system as input to create a package.
it_it: PN si riferisce a un nome di ricetta nel contesto di un file utilizzato dal sistema di build di OpenEmbedded come input per creare un pacchetto.

source: PNG file format supports True color (24/32 bit), and 8-bit palette colors.
it_it: Il formato file PNG supporta colori True Color (24/32 bit) e colori della tavolozza a 8 bit.

source: POSIX (Linux and Windows using POSIX function .e.g ``open``, ``read``)
it_it: POSIX Linux e Windows che utilizzano le funzioni POSIX, ad esempio ``open``, ``read``)

source: PPA (Pixel Processing Accelerator) Support
it_it: Supporto per il PPA (Pixel Processing Accelerator)

source: PR does not need to be increased for changes that do not change the package contents or metadata.
it_it: Il PR non deve essere aumentato per le modifiche che non alterano il contenuto o i metadati del pacchetto.

source: PV is generally not overridden within a recipe unless it is building an unstable (i.e. development) version from a source code repository (e.g. Git or Subversion).
it_it: PV generalmente non viene sovrascritto all'interno di una ricetta, a meno che non si stia compilando una versione instabile (ad esempio, di sviluppo) da un repository di codice sorgente (ad esempio Git o Subversion).

source: PV is the default value of the PKGV variable.
it_it: PV è il valore predefinito della variabile PKGV.

source: PXP accelerator
it_it: Acceleratore PXP

source: PXP can only rotate the frames in angles that are multiple of 90 degrees.
it_it: PXP può ruotare i fotogrammi solo di angoli multipli di 90 gradi.

source: PXP default configuration:
it_it: Configurazione di default di PXP:

source: PXP draw initialization is done automatically in :cpp:func:`lv_init` once the PXP is enabled as a draw unit or to rotate the screen, no user code is required:
it_it: L'inizializzazione del disegno PXP viene eseguita automaticamente in :cpp:func:`lv_init` una volta che il PXP è abilitato come unità di disegno o per ruotare lo schermo, non è richiesto alcun codice utente:

source: PXP is set to process 16x16 blocks to optimize the system for memory bandwidth and image processing time.
it_it: PXP è impostato per elaborare blocchi 16x16 per ottimizzare il sistema in termini di larghezza di banda di memoria e tempo di elaborazione delle immagini.

source: PXP related code depends on two drivers provided by MCU SDK.
it_it: Il codice relativo a PXP dipende da due driver forniti dall'SDK MCU.

source: Pack directory trees into a single "blob" and load them at runtime.
it_it: Comprimere gli alberi delle directory in un singolo "blob" e caricali in fase di esecuzione.

source: Pad text labels away from the scale ticks/remainder of the ``LV_PART_``
it_it: Allontana le etichette di testo dai segni di graduazione/dal resto di ``LV_PART_``

source: Padding
it_it: Padding [riempimento]

source: Padding properties make the tick box larger in the respective directions.
it_it: Le proprietà di "padding" [riempimento] ingrandiscono la tick box nelle rispettive direzioni.

source: Padding values can be asymmetric as well.
it_it: I valori di padding possono anche essere asimmetrici.

source: Padding values can be used to add space between the text and the edges of the Label's background.
it_it: I valori di padding possono essere utilizzati per aggiungere spazio tra il testo e i bordi del background dell'etichetta.

source: Pagination
it_it: Paginazione

source: Paired Values
it_it: Valori Abbinati

source: Palette and Alpha index
it_it: Palette e indice Alfa

source: Palette colors are always ``ARGB8888``.
it_it: I colori della palette sono sempre ``ARGB8888``.

source: Pan preview
it_it: Anteprima pan

source: Panel PCs
it_it: Panel PC

source: Parameter binding for real-time monitoring and control of object properties (position, rotation, scale)
it_it: Binding di parametri per il monitoraggio e il controllo in tempo reale delle proprietà degli oggetti (posizione, rotazione, scala)

source: Parameters
it_it: Parametri

source: Parameters with the same name as the property can be referenced directly.
it_it: I parametri con lo stesso nome della proprietà possono essere referenziati direttamente.

source: Parent
it_it: Genitore

source: Parents and Children
it_it: Genitori e Figli

source: Partial Render Mode
it_it: Modalità di Rendering Parziale

source: Partial mode can be activated via the macro in ``src/board_init.c`` file of the demo projects.
it_it: La modalità parziale può essere attivata tramite la macro nel file ``src/board_init.c`` dei progetti demo.

source: Partially decode based on specified area (Optional: use if ``decoder_open()`` does not decode whole image.)
it_it: Decodifica parzialmente in base all'area specificata (facoltativo: da utilizzare se ``decoder_open()`` non decodifica l'intera immagine).

source: Partner Supported
it_it: Partner Supportato

source: Parts
it_it: Parti

source: Parts and States
it_it: Parti e Stati

source: Parts and Styles
it_it: Parti e Stili

source: Parts are similar to *pseudo-elements* in CSS.
it_it: Le parti sono simili agli *pseudo-elements* in CSS.

source: Pass 0 for ``separator_position`` to display no decimal point.
it_it: Passare 0 per ``separator_position`` per non visualizzare alcun separatore decimale.

source: Pass :c:macro:`LV_DRAW_LABEL_NO_TXT_SEL` to specify no text selected.
it_it: Passare :c:macro:`LV_DRAW_LABEL_NO_TXT_SEL` per specificare che non è stato selezionato alcun testo.

source: Pass ``NULL`` if no image should be shown, but the character itself.
it_it: Si passa ``NULL`` se non deve essere visualizzata alcuna immagine, ma il carattere stesso.

source: Pass a pointer to a ``struct`` as the first argument of both the registration function and the callback.
it_it: Passare un puntatore a una ``struct`` come primo argomento sia della funzione di registrazione che della callback.

source: Passing ``""`` means "do not insert anything".
it_it: Passare ``""`` significa "non inserire nulla".

source: Passing references to 20 Widgets as function parameters is not ideal.
it_it: Passare riferimenti a 20 Widget come parametri di funzione non è l'ideale.

source: Password mode
it_it: Modalità password

source: Patch file is also defined in **SRC_URI** variable.
it_it: Il file della patch è definito anche nella variabile **SRC_URI**.

source: Patch task locates the patch files and applies the patches to the sources if any patch is available.
it_it: Il task "patch" individua i file delle patch e applica le patch ai sorgenti, se disponibili.

source: Patch version: backward-compatible bug fixes.
it_it: Versione patch: correzioni di bug retrocompatibili.

source: Path to the font file
it_it: Path del file del font

source: Pause and Resume
it_it: Pausa e Ripristino

source: Pause animation
it_it: Pausa animazione

source: Pausing Animations
it_it: Messa in Pausa delle Animazioni

source: Pausing the Indev Timer
it_it: Mettere in Pausa il Timer di Indev

source: Per-display performance structures
it_it: Strutture delle prestazioni per display

source: Percentage
it_it: Percentuale

source: Percentage values are relative to Widget's height.
it_it: I valori percentuali sono relativi all'altezza del Widget.

source: Percentage values are relative to Widget's width.
it_it: Sposta il widget con questo valore nella direzione Y.

source: Percentage values are relative to the height of the parent's content area.
it_it: I valori percentuali sono relativi all'altezza dell'area del "content" dell'elemento padre.

source: Percentage values are relative to the width of the parent's content area.
it_it: I valori percentuali sono relativi alla larghezza dell'area del "content" dell'elemento padre.

source: Percentage-based translation is relative to the widget’s own size (not the parent).
it_it: La traslazione basata sulla percentuale è relativa alle dimensioni del widget (non a quelle del widget padre).

source: Percentage.
it_it: Percentuale.

source: Perfetto log parsing fails
it_it: Il parsing del log di Perfetto fallisce

source: Perform a web search for ``pydevd_pycharm`` or ``debugpy`` for details about how to use the debugger.
it_it: Eseguire una ricerca sul web per ``pydevd_pycharm`` o ``debugpy`` per dettagli su come utilizzare il debugger.

source: Performance Considerations
it_it: Considerazioni sulle Prestazioni

source: Performance Measurement
it_it: Misurazione delle Prestazioni

source: Performance Monitor
it_it: Monitor delle Prestazioni

source: Performance Notes
it_it: Note sulle Prestazioni

source: Performance Tuning in LVGL
it_it: Ottimizzazione delle prestazioni in LVGL

source: Performance analysis
it_it: Analisi delle prestazioni

source: Performance can be improved by using DMA with double buffering.
it_it: Le prestazioni possono essere migliorate utilizzando DMA con doppio buffering.

source: Performance optimization: Leverage GPU acceleration for rendering.
it_it: Ottimizzazione delle prestazioni: Sfrutta l'accelerazione GPU per il rendering.

source: Performance will be the same or slightly worse if the drawn areas are never found in the cache due to Widgets with continuously varying colors or shapes.
it_it: Le prestazioni saranno le stesse o leggermente peggiori se le aree disegnate non vengono mai trovate nella cache a causa di widget con colori o forme che variano continuamente.

source: Performance: ``perf_update_timer_cb``
it_it: Prestazioni: ``perf_update_timer_cb``

source: Permanent :ref:`display_screen_layers` are part of each :ref:`display` object.
it_it: I :ref:`display_screen_layers` permanenti fanno parte di ciascun oggetto :ref:`display`.

source: Permanent Screens
it_it: Screen Permanenti

source: Permitted Usage
it_it: Utilizzo Consentito

source: Physical display assignment
it_it: Assegnazione del display fisico

source: Physically Based Rendering (PBR) materials with full texture support:
it_it: Materiali "Physically Based Rendering (PBR)" [rendering basati sulla fisica] con supporto completo delle texture:

source: Pick the Editor executable when prompted.
it_it: Selezionare l'eseguibile dell'Editor quando richiesto.

source: Pick the project to which the currently active file (in the code editor) belongs.
it_it: Seleziona il progetto a cui appartiene il file attualmente attivo (nel code editor).

source: Pie Chart with clickable slices using Arcs
it_it: Grafico a torta con sezioni cliccabili tramite Archi

source: PikaScript has a unique C module smart binding tool.
it_it: PikaScript dispone di un esclusivo strumento di binding intelligente per i moduli C.

source: PikaScript now supports the main features of LVGL8, and these APIs are fully compatible with MicroPython.
it_it: PikaScript ora supporta le funzionalità principali di LVGL8 e queste API sono pienamente compatibili con MicroPython.

source: Pinyin IME 26 key input
it_it: Pinyin IME input 26 tasti

source: Pinyin IME 9 key input
it_it: Pinyin IME input 9 tasti

source: Pinyin IME provides an API to provide Chinese Pinyin input method (Chinese input) for a Keyboard Widget, which supports both 26-key and 9-key input modes.
it_it: Pinyin IME fornisce un'API per fornire il metodo di input Pinyin cinese (input cinese) per un Widget Keyboard, che supporta sia la modalità di input a 26 tasti che a 9 tasti.

source: Pixel and percentage (with `lv_pct(x)`) values can be used.
it_it: È possibile utilizzare valori in pixel e percentuali (con `lv_pct(x)`).

source: Pixel and percentage values can be used.
it_it: È possibile utilizzare i valori in pixel e in percentuale.

source: Pixel, percentage and `LV_SIZE_CONTENT` can be used.
it_it: È possibile utilizzare i valori in pixel, percentuale e `LV_SIZE_CONTENT`.

source: Pixel, percentage and `LV_SIZE_CONTENT` values can be used.
it_it: È possibile utilizzare i valori in pixel, percentuale e `LV_SIZE_CONTENT`.

source: Pixels express alpha only (used where color is supplied elsewhere as with fonts)
it_it: I pixel esprimono solo l'alfa (utilizzati quando il colore è fornito altrove, come per i font)

source: Place another Widget on the knob
it_it: Posizionare un altro Widget sulla manopola

source: Place example code in a code block by surrounding it with ``@code{.c}`` and ``@endcode`` commands.
it_it: Inserire il codice di esempio in un blocco di codice circondandolo con i comandi ``@code{.c}`` e ``@endcode``.

source: Placeholder text
it_it: Testo segnaposto

source: Placeholder text is text that is displayed when the Text Area is empty.
it_it: Il testo segnaposto è il testo che viene visualizzato quando la Text Area è vuota.

source: Play videos and multimedia content directly within LVGL UIs with full GStreamer codec support.
it_it: Riproduce video e contenuti multimediali direttamente nelle interfacce utente LVGL con supporto completo del codec GStreamer.

source: Play, pause, and stop operations
it_it: Operazioni di riproduzione, pausa e arresto

source: Playback Control
it_it: Controllo della Riproduzione

source: Playback animation
it_it: Riproduzione di animazione

source: Playback rate control (slow motion and fast forward)
it_it: Controllo della velocità di riproduzione (rallentatore e avanzamento rapido)

source: Playing Timelines
it_it: Riproduzione di Timeline

source: Please also note that the driver does not handle the draw buffer allocation, because this may be platform-dependent, too.
it_it: Si noti inoltre che il driver non gestisce l'allocazione del "draw buffer" [buffer di disegno], poiché anche questa potrebbe dipendere dalla piattaforma.

source: Please check the completeness of the logs.
it_it: Verificare la completezza dei log.

source: Please check your drawing unit.
it_it: Verificare l'unità di disegno.

source: Please enable ``LV_USE_LOG`` and launch the simulator executable like so
it_it: Abilitare ``LV_USE_LOG`` e avviare l'eseguibile del simulatore in questo modo.

source: Please note that enabling this check will decrease runtime performance.
it_it: Si noti che l'abilitazione di questo controllo ridurrà le prestazioni del runtime.

source: Please note that while display flushing is handled by the driver, it is the user's responsibility to call :cpp:func:`lv_display_flush_ready` when the color transfer completes.
it_it: Si noti che, sebbene il flushing del display sia gestito dal driver, è responsabilità dell'utente chiamare :cpp:func:`lv_display_flush_ready` al termine del trasferimento del colore.

source: Please note, that while lottie animations are capable of running on many ESP chips, below is recommended for best performance.
it_it: Si prega di notare che, sebbene le animazioni lottie siano in grado di funzionare su molti chip ESP, per prestazioni ottimali si consiglia di seguire le istruzioni riportate di seguito.

source: Please notice from FSP version 6.0 and above, LVGL is now part of the middleware section of components.
it_it: Si noti che a partire dalla versione 6.0 di FSP, LVGL fa ora parte della sezione middleware dei componenti.

source: Please notice that enabling this option will be only available when using the PSRAM memory and double buffer mode, otherwise a compiler error will be raised.
it_it: Si noti che l'abilitazione di questa opzione sarà disponibile solo quando si utilizza la memoria PSRAM e la modalità doppio buffer, altrimenti verrà generato un errore del compilatore.

source: Please notice that such option can be set via menuconfig using the standard IDF command for configuration: `idf.py menuconfig`.
it_it: Si noti che tale opzione può essere impostata tramite menuconfig utilizzando il comando IDF standard per la configurazione: `idf.py menuconfig`.
